import type { MDPowerLocaleData } from '../../shared/locale'

export const ruLocale: MDPowerLocaleData = {
  common: {
    copy: 'Копировать',
    copied: 'Скопировано',
  },
  encrypt: {
    hint: 'Контент зашифрован, разблокируйте для просмотра.',
    placeholder: 'Введите пароль',
    incPwd: 'Неверный пароль',
    noContent: 'Разблокировано, но не удалось загрузить содержимое. Повторите попытку позже.',
    warningTitle: '🚨 Предупреждение безопасности:',
    warningText: 'Ваше соединение не защищено HTTPS, что создает риск утечки данных и блокирует доступ к зашифрованному контенту.',
  },
}
